# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
ser1 = pd.Series(np.random.randint(1, 5, 100))
ser2 = pd.Series(np.random.randint(1, 4, 100))
ser3 = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.DataFrame([ser1, ser2, ser3])
df = df.T
df.head()

   0  1      2
0  1  3  12048
1  1  3  15333
2  3  1  25837
3  3  2  19943
4  1  2  16940

In [16]:
## 모범
df_a = pd.concat([ser1, ser2, ser3], axis=1)
df_a.head()

   0  1      2
0  1  3  12048
1  1  3  15333
2  3  1  25837
3  3  2  19943
4  1  2  16940

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       3            12048
1      1       3            15333
2      3       1            25837
3      3       2            19943
4      1       2            16940

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
ser1_df = pd.DataFrame(ser1)
ser2_df = pd.DataFrame(ser2)
ser3_df = pd.DataFrame(ser3)
bigcolumn = pd.concat([ser1_df, ser2_df, ser3_df])
bigcolumn.tail()

        0
95  25298
96  29448
97  29509
98  16839
99  29103

In [19]:
## 모범
bigcolumn_a = pd.concat([ser1, ser2, ser3])
bigcolumn_a.tail()

95    25298
96    29448
97    29509
98    16839
99    29103
dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [14]:
bigcolumn.index

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
       ...
       90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
      dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [15]:
bigcolumn = bigcolumn.reset_index(drop=True)
bigcolumn.tail()

         0
295  25298
296  29448
297  29509
298  16839
299  29103